{
    "result": [
        {
            "item_id": "11351c5b-ee9c-4049-b900-bb8450b3d3e6",
            "image": "https://picsum.photos/300/400/?image=1050",
            "title": "Entire",
            "price": {
                "value": 3.2,
                "currency": "$"
            },
            "description": "Spring vote always turn again. Accept actually young discuss. Type management west ahead blood between.\nBad pressure doctor onto. Green policy half while fear suddenly wind.\nInteresting stage pressure center talk learn financial material. Teach if this attack. So agree recognize result at move couple.\nEat magazine stand book cover skill blue whether. Air set easy east do environment knowledge. Federal floor my himself action born history.",
            "category": "Blue"
        },
        {
            "item_id": "57a44ce6-e8f9-43bf-afc9-14fe46ef285c",
            "image": "https://picsum.photos/400/300/?image=27",
            "title": "Fish",
            "price": {
                "value": 5.7,
                "currency": "$"
            },
            "description": "Well environment place child happy provide quite watch. Us reality understand modern defense over.\nForm marriage network first increase those hundred back. Various similar quickly their player data smile. Back garden poor life individual certainly.\nExactly program beyond daughter big. Across thousand like. Stock chance visit positive own.\nOf media level whom western. Nice over line view.\nMother quite always prevent charge. Opportunity whom citizen.",
            "category": "Green"
        },
        {
            "item_id": "0896f05b-4818-42dc-8341-f45524fffd55",
            "image": "https://picsum.photos/400/300/?image=952",
            "title": "Total",
            "price": {
                "value": 8.8,
                "currency": "€"
            },
            "description": "Strong project case cost would tell evening. Future draw become manage me.\nTotal employee huge seek your. Bag protect daughter mission voice first religious. Your nature view general what free response.\nBreak feel south knowledge space notice.\nNor recently green build Congress home onto. Mother senior bill particular.\nStrong few attack. Evening clearly identify sell.\nCarry reach find. Enter force itself say.\nCrime strong generation bar natural total.",
            "category": "Purple"
        },
        {
            "item_id": "d2643840-ea60-4d46-a8e5-804f2f084792",
            "image": "https://picsum.photos/400/400/?image=46",
            "title": "Drug",
            "price": {
                "value": 3.7,
                "currency": "£"
            },
            "description": "List language specific strong who term subject money. Improve end message.\nMusic represent whatever and fund instead. Couple process region claim home green. House could newspaper face their nation perhaps board.\nCall technology international money. Certainly rule film lot.\nDrop home writer build. Machine near actually next. Spend management guess new. They imagine remember as what.\nOver value up beyond. Popular world sometimes head goal. Economic significant out floor.",
            "category": "Fuchsia"
        },
        {
            "item_id": "9e129472-e192-4037-888a-ab1646ab108e",
            "image": "https://picsum.photos/300/400/?image=742",
            "title": "Perhaps",
            "price": {
                "value": 7.0,
                "currency": "£"
            },
            "description": "Open both least stage material. Life hotel race such tonight still nearly. Painting threat door draw any.\nTruth lead ability business politics else. Notice meeting early response stop.\nEvent medical piece put reality remember. Set or reflect somebody.\nSummer color long consider more. Ball customer fear mean political relationship affect.\nOften common hospital expect. Reach say pass year create.\nNeed poor themselves actually.",
            "category": "Green"
        },
        {
            "item_id": "1446e27a-d27c-48ec-a854-54cda6c09300",
            "image": "https://picsum.photos/400/300/?image=157",
            "title": "Two",
            "price": {
                "value": 7.1,
                "currency": "£"
            },
            "description": "Choose take but actually argue. On own finally production bed little.\nComputer social whose although perform bank. Specific capital professional whatever. Model organization between increase.\nSay summer debate speech. Step bit institution situation material some.\nInstitution month system government then factor. Else skill magazine material dream that. Own likely result her.\nHuge suggest reason though. Different program mother series example few example.",
            "category": "Blue"
        },
        {
            "item_id": "dbcb7794-04f1-4677-b463-cab51fa5e08a",
            "image": "https://picsum.photos/400/300/?image=696",
            "title": "Former",
            "price": {
                "value": 5.2,
                "currency": "$"
            },
            "description": "Majority allow bar their. Reflect study professional. Do shoulder right after less official issue.\nWhile social international want often oil. Left range check authority. Memory window market.\nEight sell candidate moment begin public project. Affect pretty table not bed effort customer. Reach need available next other different.\nSix buy southern bed will particularly myself choose. American imagine tax current option center.",
            "category": "Purple"
        },
        {
            "item_id": "8a2e3e8c-4ff5-4686-87d3-560d5520cd0b",
            "image": "https://picsum.photos/400/300/?image=379",
            "title": "Start",
            "price": {
                "value": 4.6,
                "currency": "£"
            },
            "description": "Why commercial interesting sport wrong center call. Middle company before alone. Then customer part relationship debate perhaps list.\nElse recognize quite between their begin foot. Activity industry billion. Here shake suggest style picture.\nPeace southern myself provide. Man class again education. Page hot billion range compare.\nSocial cold read price. Force goal Congress huge who certainly campaign. Difference course threat modern everyone natural apply.",
            "category": "Olive"
        },
        {
            "item_id": "a98ea0d3-2dc5-42c9-8b7a-58eba19a656e",
            "image": "https://picsum.photos/400/400/?image=846",
            "title": "Like",
            "price": {
                "value": 9.0,
                "currency": "€"
            },
            "description": "Usually protect set offer skin door picture. Strong we exist gas want effort. Design south discuss over us during Mr.\nTurn floor explain hospital staff like see. Develop country difference seek. Base large environmental onto actually well expect.\nGlass scene ready through tend hold. Line inside share throw around tough miss.\nFast detail drop whose. Line hear ten.\nWay throughout become worry sign west oil.",
            "category": "Fuchsia"
        },
        {
            "item_id": "d92203bb-80e4-484b-8314-ec0491da3fb3",
            "image": "https://picsum.photos/400/300/?image=606",
            "title": "War",
            "price": {
                "value": 8.8,
                "currency": "£"
            },
            "description": "Behind give sure. Idea officer environment air tonight maybe write. We offer forward.\nReason campaign chance soon. International continue exist where challenge less. Scene finish wind yard nature.\nMay far difficult personal father past oil. Care order garden thus arrive.\nOperation approach western enter. Else of reach.\nAgain board create southern account friend. Protect second similar operation not physical loss. Wonder second quite.",
            "category": "Fuchsia"
        }
    ],
    "next": "https://mobile-code-challenge.s3.eu-central-1.amazonaws.com/catalog1",
    "prev": null,
    "total": 123
}
